# Brewfile for dotconf
# Install everything: `brew bundle --file=~/dotconf/Brewfile`
# Check status:       `brew bundle check --file=~/dotconf/Brewfile`
# Remove extras:      `brew bundle cleanup --file=~/dotconf/Brewfile`

# ── Shell & prompt ────────────────────────────────────────────────────────────
brew "fish"
brew "starship"

# ── CLI tools ─────────────────────────────────────────────────────────────────
brew "bat"                  # cat replacement
brew "eza"                  # ls replacement
brew "fzf"                  # fuzzy finder
brew "zoxide"               # smarter cd
brew "fastfetch"            # system info on shell start
brew "fortune"              # used by fortune-gca.sh
brew "stow"                 # used by stow-all.sh
brew "lazydocker"
brew "fortune"
          

# ── GitHub ────────────────────────────────────────────────────────────────────
brew "gh"

# ── Apps ──────────────────────────────────────────────────────────────────────
cask "ghostty"
cask "zed"
cask "orbstack"

# ── Fonts ─────────────────────────────────────────────────────────────────────
cask "font-jetbrains-mono-nerd-font"

# ── Not installable via brew (manual setup) ───────────────────────────────────
# Fisher + fish plugins (run inside fish after `brew install fish`):
#   curl -sL https://raw.githubusercontent.com/jorgebucaran/fisher/main/functions/fisher.fish | source && fisher install jorgebucaran/fisher
#   fisher install edc/bass jorgebucaran/nvm.fish catppuccin/fish edouard-lopez/ayu-theme.fish patrickf1/fzf.fish
#
# Bun:    curl -fsSL https://bun.sh/install | bash
# Flyctl: curl -L https://fly.io/install.sh | sh
# Stylus: browser extension (Chrome/Firefox web store)
# DASH: gh extension install dlvhdr/gh-dash

